## 3.8. 반대, 추가 및 호환성

```
사이퍼는 계속 진화하는 언어입니다. 언어에 새로운 특징이 추가되고 있고, 몇가지 특징은 연속적으로 제거되기도 합니다.
```

+ 반대, 추가 및 호환성
	+ 버전 3.0
	+ 버전 3.1
	+ 버전 3.2
	+ 버전 3.3
	+ 버전 3.4

+ 호환성
+ 지원 언어 버전


### 3.8.1. 제거, 반대, 추가 및 확장

아래는 사이퍼에서 제거, 반대, 추가 및 확장된 특징을 모두 리스트 합니다. 사용하지 않고 제거된 대체 구문도 표시됩니다.

**3.8.1.1. 버전 3.0**

| 특징                                                         | 유형 | 변화                  | 상세 내용                          |
| ------------------------------------------------------------ | ---- | --------------------- | ---------------------------------- |
| ```has()```                                                  | 함수 | 제거됨                | exist()으로 대체                   |
| ```str()```                                                  | 함수 | 제거됨                | toString()으로 대체                |
| ```{parameter}```                                            | 구문 | 더 이상 사용하지 않음 | $parameter로 대체                  |
| [properties()](./functions.md)                               | 함수 | 추가                  |                                    |
| [CALL[..YIELD]](./clauses.md)                                | 구문 | 추가                  |                                    |
| [point() - Cartesian 2D](./functions.md)                     | 함수 | 추가                  |                                    |
| [point() - WGS 84 2D](./functions.md)                        | 함수 | 추가                  |                                    |
| [distance()](./functions.md)                                 | 함수 | 추가                  |                                    |
| [사용자 정의 절차][User-defined procedures](/extending-neo4j/procedures.md) | 기능 | 추가                  |                                    |
| [toString()](./functions.md)                                 | 함수 | 확장                  | 입력 값으로 불 대수 연산 추가 가능 |


**3.8.1.2. 버전 3.1**

| 특징                                                        | 유형 | 변화          | 상세 내용                                                    |
| ----------------------------------------------------------- | ---- | ------------- | ------------------------------------------------------------ |
| ```rels()```                                                | 함수 | 사용하지 않음 | relationships()가 대체합니다.                                |
| ```toInt()```                                               | 함수 | 사용하지 않음 | toInteger()가 대체합니다.                                    |
| ```lower()```                                               | 함수 | 사용하지 않음 | toLower()가 대체합니다.                                      |
| ```upper()```                                               | 함수 | 사용하지 않음 | toUpper()가 대체합니다.                                      |
| [toBoolean()](./functions.md)                               | 함수 | 추가          |                                                              |
| [Map Projection](./syntax.md)                               | 구문 | 추가          |                                                              |
| [패턴 이해](syntax.md)                                      | 구문 | 추가          |                                                              |
| [사용자 정의 함수](/extending-neo4j/cypher-functions.md) | 기능 | 추가          |                                                              |
| [CALL...YIELD...WHERE](./clauses.md)                        | 절   | 확장          | ```YIELD```가 반환한 레코드는 ```WHERE``` 로 추가 필터링 될 수 있습니다. |


**3.8.1.3. 버전 3.2**

| 특징                                                 | 유형   | 변화                  | 상세 내용                                                    |
| ---------------------------------------------------- | ------ | --------------------- | ------------------------------------------------------------ |
| ```CYPHER planner=rule``` (규칙플래너)              | 기능성 | 제거                  | 모든 쿼리는 코스트 플래너를 사용합니다.  따라서 앞에 추가된 모든 쿼리는 사이퍼 3.1을 사용합니다. |
| ```CREATE UNIQUE```                                  | 절     | 제거                  | 쿼리를 실행하면, 사이퍼 3.1을 사용합니다.(규칙 플래너 사용)  |
| ```START```                                          | 절     | 제거                  | 쿼리를 실행하면, 사이퍼 3.1을 사용합니다.(규칙 플래너 사용)  |
| ```MATCH (n)-[rs*]-() RETURN rs```                   | 구문론 | 더 이상 사용하지 않음 | ```MATCH p=(n)-[*]-() RETURN relationships(p) AS rs```로 대체됨 |
| ```MATCH (n)-[:A:B:C {foo: 'bar'}]-() RETURN n``` | 구문론 | 더 이상 사용하지 않음 | ```MATCH (n)-[:A:B:C {foo: 'bar'}]-() RETURN n```로 대체됨  |
| ```MATCH (n)-[x:A:B:C]-() RETURN n```             | 구문론 | 더 이상 사용하지 않음 | ```MATCH (n)-[x:A:B:C]-() RETURN n```로 대체됨              |
| ```MATCH (n)-[x:A:B:C*]-() RETURN n```            | 구문론 | 더 이상 사용하지 않음 | ```MATCH (n)-[x:A:B:C*]-() RETURN n```로 대체됨             |
| 사용자 정의 통합 함수                                | 기능   | 추가                  |                                                              |
| 합성 인덱스                                          | 인덱스 | 추가                  |                                                              |
| 노드 키                                              | 인덱스 | 추가                  | Neo4j 기업용 배포판만 해당                                   |
| ```CYPHER runtime=compiled```(컴파일된 런타임)       | 기능성 | 추가                  | Neo4j 기업용 배포판만 해당                                   |
| reverse()                                            | 기능   | 확장                  | 목록을 입력으로 허용                                         |
| max(),min()                                          | 기능   | 확장                  | 문자열과 숫자 모두를 포함하는 집합 지원                      |


**3.8.1.4. 버전 3.3**

| 특징                                                       | 유형 | 변화   | 상세 내용                                                    |
| ---------------------------------------------------------- | ---- | ------ | ------------------------------------------------------------ |
| ```START```                                                | 절   | 제거됨 | 사이퍼 3.2에서와 마찬가지로 ```START```절을 사용하는 모든 쿼리는 사이퍼 3.1 ```planner=rule```로 돌아갑니다. 그러나 사용자가 Cypher의 최신 사이퍼 버전을 사용하고 인덱스에 접근하는 기본 제공 절차가 있습니다. 이 예는 ```CALL db.index.explicit.searchNodes('my_index','email:me*')```입니다. |
| ```CYPHER  runtime=slotted```(보다 빠른 인터프리터 런타임) | 기능 | 추가됨 | Neo4j 기업용 배포판만 해당                                   |
| [max(), min()](./functions.md)                             | 함수 | 확장됨 | 문자열, 숫자 및 문자열 및 / 또는 숫자 목록이 포함 된 집합과 문자열 및 / 또는 숫자 목록을 포함하는 집합도 지원 |


**3.8.1.5. 버전 3.4**

| 특징                                     | 유형 | 변화 | 상세 내용                                                    |
| ---------------------------------------- | ---- | ---- | ------------------------------------------------------------ |
| [공간 유형](./syntax.md)                 | 기능 | 개정 | 좌표 참조 시스템 사용 여부와 관계없이 포인트는 속성으로 저장할 수 있으며 인덱스로 백업할 수 있습니다. 이전에는 포인트가 가상 속성으로만 쓰였습니다. |
| [point() - Cartesian 3D](./functions.md) | 함수 | 추가 |                                                              |
| [point() - WGS 84 3D](./functions.md)    | 함수 | 추가 |                                                              |
| [randomUUID()](./functions.md)           | 함수 | 추가 |                                                              |
| [시간 유형](./syntax.md)                 | 기능 | 추가 | 저장 지원, 인덱싱, 아래 임시 유형과 같은 작업: 날짜, 시간, 현지 시각, 날짜 시간, 현지 날짜 시간과 지속 기간 |
| [시간 함수](./functions.md)              | 기능 | 추가 | 각 시간 유형의 값 조정을 허락하는 함수- 날짜, 시간, 현지 시각, 날짜 시간, 현지 날짜 시간과 지속기간 |
| [시간 연산자](./syntax.md)               | 기능 | 추가 | 각 임시 유형을 조정하는 연산자 - 날짜, 시간, 현지 시각, 날짜 시간, 현지 날짜 시간과 지속기간  유형의 값 |
| [toString()](./functions.md)             | 함수 | 확장 | 시간 값을 입력 값으로 사용할 수 있습니다.(즉, 날짜, 시간, 현지 시각, 날짜 시간, 현지 날짜시간 또는 지속 기간 유형의 값) |


### 3.8.2. 호환성

필요하다면 오래된 버전 언어를 사용할 수 있습니다. 쿼리에서 버전을 선택하는 방법은 2가지가 있습니다. 

1. 쿼리 버전 설정: 설정 변수 ```cypher.default_language_version```을 사용해서 데이터 베이스를 설정하고, 사용할 버전을 선택합니다. 아래 아이템에서와 같이 쿼리가 설정되어있지 않았을 때, 모든 사이퍼 쿼리는 이 버전을 사용합니다. 

2. 쿼리 단위로 쿼리 버전 설정: 다른 방법은 특정 쿼리에서 사용할 수 있는 버전을 설정하는 것 입니다.
```CYPHER 2.3```을 사용하여 쿼리를 추가하면 Neo4j 2.3.에 포함된 사이퍼 버전과 함께 쿼리가 실행됩니다.
 

아래는 ```has()``` 함수를 사용하는 예 입니다. 

```
CYPHER 2.3
MATCH (n:Person)
WHERE has(n.age)
RETURN n.name, n.age
```


### 3.8.3. 지원하는 언어 버전

Neo4j 3.4는 아래 버전의 Cypher 언어를 지원합니다.:

+ Neo4j Cypher 3.4
+ Neo4j Cypher 3.3
+ Neo4j Cypher 3.2
+ Neo4j Cypher 2.3


각 Neo4j는 제한된 개수의 오래된 Cypher 언어 버전을 지원합니다. Neo4j를 새 버전으로 업그레이드할 때, 필요한 Cypher 언어 버전을 지원해야 합니다. 그렇지 않으면, 새로운 Cypher 언어 버전을 쓰는 쿼리를 수정해야 합니다. 