

### 3.6.4. 플래너 힌트 및 키워드 사용 

```
플래너 힌트는 플래너의 결정에 영향을 주고 쿼리 실행 계획을 세울 때 사용합니다. 
플래너 힌트는 ```USING``` 키워드를 사용해서 쿼리에 명시됩니다. 
```
 
강제 플래너 동작은 고급 기능이여서 쿼리가 잘 수행되지 않을 수 있으므로 숙련된 개발자 또는 데이터베이스 관리자가 다루는게 좋습니다.

- 도입
- 인덱스 힌트
- 스캔 힌트
- 결합 힌트
- ```PERIODIC COMMIT``` 쿼리 힌트

#### 3.6.4.1. 도입

쿼리를 실행할 때, Neo4j는 매칭시킬 쿼리 그래프 위치를 정해야 합니다. 

```MATCH``` 절과 ```WHERE``` 조건 및 이 정보를 활용해서 유의미한 인덱스나 다른 시작점을 찾을 수 있습니다. 그러나, 선택된 인덱스는 항상 최선의 결정이 아닐 수도 있습니다. 

가끔 많은 인덱스는 후보자가 되기도 하며, 쿼리 플래너가 성능 관점에서 잘못된 것을 골라냅니다. 게다가 일부 상황에서는(비록 드물지라도) 인덱스를 아예 사용하지 않는 것이 좋습니다. 

Neo4j는 ```USING``` 키워드에서 특정 시작 점을 사용해야할 수도 있습니다. 이것은 플래너 힌트를 통해 호출합니다. 플래너 힌트는 4가지 종류가 있습니다.: 인덱스 힌트, 스캔 힌트, 결합 힌트와 ```PERIODIC COMMIT``` 쿼리 힌트.

쿼리에 ```START```절이 있다면 플래너 힌트를 사용할 수 없습니다.

그림 3.28. 그래프

![alt](https://neo4j.com/docs/developer-manual/3.4/images/Planner%20hints%20and%20the%20USING%20keyword-1.svg)

**쿼리** 

```
MATCH (liskov:Scientist { name:'Liskov' })-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science { name:'Computer Science' })<-[:RESEARCHED]-(conway:Scientist { name: 'Conway' })
RETURN 1 AS column
```

아래 쿼리는 이 페이지의 몇 가지 예에서 사용됩니다. 이 쿼리가 일치하는 특정 하위 그래프에 대해 통계 정보는 의도적으로 정확하지 않게 작성되었습니다. 이런 이유로, 플래너 힌트를 제공하면 개선될 수 있습니다. 

**쿼리 계획**

```
Compiler CYPHER 3.4

Planner COST

Runtime COMPILED

Runtime version 3.4

+-----------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| Operator        | Estimated Rows | Rows | DB Hits | Page Cache Hits | Page Cache Misses | Page Cache Hit Ratio | Time (ms) | Variables                                                         | Other                                                                          |
+-----------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +ProduceResults |              0 |    1 |       0 |               6 |                 0 |               1.0000 |     0.141 | anon[126], anon[43], anon[70], column, conway, cs, liskov, wing   |                                                                                |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +Projection     |              0 |    1 |       0 |               6 |                 0 |               1.0000 |     0.151 | column -- anon[126], anon[43], anon[70], conway, cs, liskov, wing | {column : $`  AUTOINT3`}                                                       |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +Filter         |              0 |    5 |       6 |              18 |                 0 |               1.0000 |     0.252 | anon[126], anon[43], anon[70], conway, cs, liskov, wing           | conway:Scientist; conway.name = $`  AUTOSTRING2`; not `anon[126]` = `anon[70]` |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +Expand(All)    |              0 |    3 |       4 |               6 |                 0 |               1.0000 |     0.335 | anon[126], conway -- anon[43], anon[70], cs, liskov, wing         | (cs)<-[:RESEARCHED]-(conway)                                                   |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +Filter         |              0 |    3 |       4 |              11 |                 0 |               1.0000 |     0.548 | anon[43], anon[70], cs, liskov, wing                              | cs:Science; cs.name = $`  AUTOSTRING1`                                         |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +Expand(All)    |              0 |    2 |       3 |               6 |                 0 |               1.0000 |     0.640 | anon[70], cs -- anon[43], liskov, wing                            | (wing)-[:RESEARCHED]->(cs)                                                     |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +Filter         |              0 |    1 |       1 |               6 |                 0 |               1.0000 |     0.741 | anon[43], liskov, wing                                            | wing:Scientist                                                                 |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +Expand(All)    |              0 |    1 |       2 |               6 |                 0 |               1.0000 |     0.998 | anon[43], wing -- liskov                                          | (liskov)-[:KNOWS]->(wing)                                                      |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +NodeIndexSeek  |              1 |    1 |       2 |               6 |                 0 |               1.0000 |     1.519 | liskov                                                            | :Scientist(name)                                                               |
+-----------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+

Total database accesses: 22
```

#### 3.6.4.2. 인덱스 힌트

인덱스 힌트는 플래너가 시작 지점으로 사용할 인덱스를 지정할 때 사용됩니다. 이것은 인덱스가 사용 중인 특정 값의 인덱스 통계가 정확하지 않을 때 유용하며 이로 인해 플래너는 비-최적 인덱스를 선택합니다. 
인덱스 힌트를 제공하려면, ```USING INDEX variable:Label(property)```을 ```MATCH``` 구절 이후 사용하면 됩니다.
 

여러가지 힌트를 제공할 수 있지만, 몇몇 시작점은 쿼리 플랜에서 값 비싼 결합을 요구할 수도 있습니다. 

##### 인덱스 쿼리를 이용한 쿼리

위의 쿼리는 플랜을 해결할 때 당연하게 인덱스를 선택하지는 않습니다. 이것은 그래프가 매우 작고, 라벨 스캔이 소규모 데이터베이스에서 더 빠르기 때문입니다. 그러나 일반적으로, 쿼리 성능은 dbhit 메트릭에 의해 순위가 매겨지며, 이 쿼리에서 인덱스를 사용하면 더 좋습니다. 

**쿼리**

```
MATCH (liskov:Scientist { name:'Liskov' })-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science { name:'Computer Science' })<-[:RESEARCHED]-(conway:Scientist { name: 'Conway' })
USING INDEX liskov:Scientist(name)
RETURN liskov.born AS column
```

'Barbara Liskov'가 태어난 년도를 반환합니다. 

**쿼리 계획**

```
Compiler CYPHER 3.4

Planner COST

Runtime COMPILED

Runtime version 3.4

+-----------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| Operator        | Estimated Rows | Rows | DB Hits | Page Cache Hits | Page Cache Misses | Page Cache Hit Ratio | Time (ms) | Variables                                                         | Other                                                                          |
+-----------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +ProduceResults |              0 |    1 |       0 |               6 |                 0 |               1.0000 |     3.340 | anon[126], anon[43], anon[70], column, conway, cs, liskov, wing   |                                                                                |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +Projection     |              0 |    1 |       1 |               6 |                 0 |               1.0000 |     3.357 | column -- anon[126], anon[43], anon[70], conway, cs, liskov, wing | {column : liskov.born}                                                         |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +Filter         |              0 |    5 |       6 |              18 |                 0 |               1.0000 |     3.414 | anon[126], anon[43], anon[70], conway, cs, liskov, wing           | conway:Scientist; conway.name = $`  AUTOSTRING2`; not `anon[126]` = `anon[70]` |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +Expand(All)    |              0 |    3 |       4 |               6 |                 0 |               1.0000 |     3.486 | anon[126], conway -- anon[43], anon[70], cs, liskov, wing         | (cs)<-[:RESEARCHED]-(conway)                                                   |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +Filter         |              0 |    3 |       4 |              11 |                 0 |               1.0000 |     3.662 | anon[43], anon[70], cs, liskov, wing                              | cs:Science; cs.name = $`  AUTOSTRING1`                                         |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +Expand(All)    |              0 |    2 |       3 |               6 |                 0 |               1.0000 |     3.724 | anon[70], cs -- anon[43], liskov, wing                            | (wing)-[:RESEARCHED]->(cs)                                                     |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +Filter         |              0 |    1 |       1 |               6 |                 0 |               1.0000 |     3.768 | anon[43], liskov, wing                                            | wing:Scientist                                                                 |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +Expand(All)    |              0 |    1 |       2 |               6 |                 0 |               1.0000 |     3.985 | anon[43], wing -- liskov                                          | (liskov)-[:KNOWS]->(wing)                                                      |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+
| +NodeIndexSeek  |              1 |    1 |       2 |               6 |                 0 |               1.0000 |     4.469 | liskov                                                            | :Scientist(name)                                                               |
+-----------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+--------------------------------------------------------------------------------+

Total database accesses: 23
```

##### 다양한 인덱스 힌트를 사용하는 쿼리 

하나의 인덱스 힌트는 쿼리의 시작점을 바꿨지만, 플랜은 아직 선으로 되어있으며 이는 하나의 시작점만 가지는 것을 의미합니다. 플래너에 또 다른 인덱스 힌트를 주면, 매치의 양쪽 끝에 두 가지 시작점을 사용합니다. 그 이후, 조인 연산자를 이용해서 이 두가지 브랜치를 결합합니다. 

**쿼리**

```
MATCH (liskov:Scientist { name:'Liskov' })-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science { name:'Computer Science' })<-[:RESEARCHED]-(conway:Scientist { name: 'Conway' })
USING INDEX liskov:Scientist(name)
USING INDEX conway:Scientist(name)
RETURN liskov.born AS column
```

더 나은 플랜을 사용해서 'Barbara Liskov'가 태어난 해를 리턴합니다. 

**쿼리 계획**

```
Compiler CYPHER 3.4

Planner COST

Runtime COMPILED

Runtime version 3.4

+---------------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+----------------------------------------+
| Operator            | Estimated Rows | Rows | DB Hits | Page Cache Hits | Page Cache Misses | Page Cache Hit Ratio | Time (ms) | Variables                                                         | Other                                  |
+---------------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+----------------------------------------+
| +ProduceResults     |              0 |    1 |       0 |               7 |                 0 |               1.0000 |     0.177 | anon[126], anon[43], anon[70], column, conway, cs, liskov, wing   |                                        |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+----------------------------------------+
| +Projection         |              0 |    1 |       1 |               7 |                 0 |               1.0000 |     0.210 | column -- anon[126], anon[43], anon[70], conway, cs, liskov, wing | {column : liskov.born}                 |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+----------------------------------------+
| +Filter             |              0 |    1 |       0 |               7 |                 0 |               1.0000 |     0.218 | anon[126], anon[43], anon[70], conway, cs, liskov, wing           | not `anon[126]` = `anon[70]`           |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+------------------------------------------------------------------+----------------------------------------+
| +NodeHashJoin       |              0 |    1 |       0 |              12 |                 0 |               1.0000 |     0.854 | anon[43], anon[70], liskov, wing -- anon[126], conway, cs         | cs                                     |
| |\                  +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+----------------------------------------+
| | +Expand(Into)     |              0 |    1 |       2 |               7 |                 0 |               1.0000 |     1.423 | anon[126] -- conway, cs                                           | (cs)<-[:RESEARCHED]-(conway)           |
| | |                 +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+----------------------------------------+
| | +CartesianProduct |              1 |    1 |       0 |               7 |                 0 |               1.0000 |     1.431 | cs -- conway                                                      |                                        |
| | |\                +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+----------------------------------------+
| | | +NodeIndexSeek  |              1 |    1 |       2 |               7 |                 0 |               1.0000 |     1.589 | conway                                                            | :Scientist(name)                       |
| | |                 +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+----------------------------------------+
| | +NodeIndexSeek    |              1 |    1 |       2 |               7 |                 0 |               1.0000 |     1.734 | cs                                                                | :Science(name)                         |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+----------------------------------------+
| +Filter             |              0 |    3 |       4 |              10 |                 0 |               1.0000 |     0.782 | anon[43], anon[70], cs, liskov, wing                              | cs:Science; cs.name = $`  AUTOSTRING1` |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+----------------------------------------+
| +Expand(All)        |              0 |    2 |       3 |               5 |                 0 |               1.0000 |     0.854 | anon[70], cs -- anon[43], liskov, wing                            | (wing)-[:RESEARCHED]->(cs)             |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+----------------------------------------+
| +Filter             |              0 |    1 |       1 |               5 |                 0 |               1.0000 |     0.946 | anon[43], liskov, wing                                            | wing:Scientist                         |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+----------------------------------------+
| +Expand(All)        |              0 |    1 |       2 |               5 |                 0 |               1.0000 |     1.170 | anon[43], wing -- liskov                                          | (liskov)-[:KNOWS]->(wing)              |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+----------------------------------------+
| +NodeIndexSeek      |              1 |    1 |       2 |               5 |                 0 |               1.0000 |     1.588 | liskov                                                            | :Scientist(name)                       |
+---------------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+----------------------------------------+

Total database accesses: 19
```

#### 3.6.4.3. 스캔 힌트

쿼리가 인덱스의 더 큰 파트에 매치된다면, 매치하지 않는 것을 스캔하거나 노드를 필터링할 때 더 빠릅니다. 이 작업을 하려면, ```MATCH``` 절 적용 후에 ```USING SCAN variable:Label```을 사용하면 됩니다. 이것은 Cypher가 라벨 스캔을 하는 대신에 이전에 사용되지 않았던 인덱스를 사용하도록 합니다.

##### 라벨 스캔 힌트

레이블의 모든 노드를 스캔 하고 그 집합을 필터링하여 최상의 성능을 얻으려면 ```USING SCAN```을 사용하면 됩니다.

**쿼리**

```
MATCH (s:Scientist)
USING SCAN s:Scientist
WHERE s.born < 1939
RETURN s.born AS column
```

**'1939'** 이전에 태어난 모든 과학자를 반환합니다. 

**쿼리 계획**

```
Compiler CYPHER 3.4

Planner COST

Runtime SLOTTED

Runtime version 3.4

+------------------+----------------+------+---------+-----------------+-------------------+----------------------+-------------+------------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Page Cache Hits | Page Cache Misses | Page Cache Hit Ratio | Variables   | Other                  |
+------------------+----------------+------+---------+-----------------+-------------------+----------------------+-------------+------------------------+
| +ProduceResults  |              0 |    2 |       0 |               2 |                 0 |               1.0000 | column, s   |                        |
| |                +----------------+------+---------+-----------------+-------------------+----------------------+-------------+------------------------+
| +Projection      |              0 |    2 |       2 |               2 |                 0 |               1.0000 | column -- s | {column : s.born}      |
| |                +----------------+------+---------+-----------------+-------------------+----------------------+-------------+------------------------+
| +Filter          |              0 |    2 |       7 |               2 |                 0 |               1.0000 | s           | s.born < $`  AUTOINT0` |
| |                +----------------+------+---------+-----------------+-------------------+----------------------+-------------+------------------------+
| +NodeByLabelScan |              7 |    7 |       8 |               3 |                 0 |               1.0000 | s           | :Scientist             |
+------------------+----------------+------+---------+-----------------+-------------------+----------------------+-------------+------------------------+

Total database accesses: 17
```

#### 3.6.4.4. 결합 힌트 

결합 힌트는 힌트에서 가장 발전된 타입이며, 쿼리 실행 플랜에서 시작점을 찾을 때 사용하지 않지만 결합이 특정 지점에서 이루어지도록 합니다. 이것은 쿼리가이 리프(leaf)에서 오름차순으로 두 지점에 결합할 수 있도록 플랜에 두 개 이상의 시작점 (리프)이 있어야 함을 의미합니다. 이런 특성으로 인해서 조인 및 이후 조인 힌트는 플래너가 강제로 추가 시작점을 찾도록 할 것 입니다. 또한, 좋은 시작점이 없을 경우 잠재적으로 나쁜 시작점을 선택합니다. 이것은 쿼리 성능에 안 좋은 영향을 줍니다. 다른 경우, 힌트는 플래너가 *seemingly*  나쁜 시작점을 선택하도록 합니다. 이는 현실에서는 좋은 것 입니다. 


##### 단일 노드에서 결합 힌트 

많은 인덱스 힌트를 사용하는 예에서 플래너가 ```cs``` 노드에서 결합하도록 선택한 것을 확인할 수 있습니다. 이것은 ```wing```과 ```cs``` 관계 사이가 나가는 방향으로 지나간 것을 의미하며, 패턴 ```()-[:RESEARCHED]→(:Science)```가 패턴 ```(:Scientist)-[:RESEARCHED]→()``` 보다 일반적이기 때문에 통계적으로 더 낫습니다. 하지만, 실제 그래프에서 ```cs```노드는 오직 2가지 관계만 가지기 때문에, 이를 확장하는 것은 ```wing```노드에서 확장하는 것 보다 낫습니다. 결합 힌트 대신 ```wing```에서 결합하도록할 수 있습니다. 


**쿼리**

```
MATCH (liskov:Scientist { name:'Liskov' })-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science { name:'Computer Science' })<-[:RESEARCHED]-(conway:Scientist { name: 'Conway' })
USING INDEX liskov:Scientist(name)
USING INDEX conway:Scientist(name)
USING JOIN ON wing
RETURN wing.born AS column
```

더 나은 플랜을 사용해서 'Jeanette Wing'가 태어난 날짜를 반환합니다.

**쿼리 플랜**

```
Compiler CYPHER 3.4

Planner COST

Runtime COMPILED

Runtime version 3.4

+---------------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+------------------------------+
| Operator            | Estimated Rows | Rows | DB Hits | Page Cache Hits | Page Cache Misses | Page Cache Hit Ratio | Time (ms) | Variables                                                         | Other                        |
+---------------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+------------------------------+
| +ProduceResults     |              0 |    1 |       0 |               7 |                 0 |               1.0000 |     0.260 | anon[126], anon[43], anon[70], column, conway, cs, liskov, wing   |                              |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+------------------------------+
| +Projection         |              0 |    1 |       1 |               7 |                 0 |               1.0000 |     0.380 | column -- anon[126], anon[43], anon[70], conway, cs, liskov, wing | {column : wing.born}         |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+------------------------------+
| +NodeHashJoin       |              0 |    1 |       0 |              16 |                 0 |               1.0000 |     1.035 | anon[43], liskov -- anon[126], anon[70], conway, cs, wing         | wing                         |
| |\                  +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+------------------------------+
| | +Filter           |              1 |    2 |       0 |              19 |                 0 |               1.0000 |     0.474 | anon[126], anon[70], conway, cs, wing                             | not `anon[126]` = `anon[70]` |
| | |                 +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+------------------------------+
| | +Expand(All)      |              1 |    3 |       4 |               7 |                 0 |               1.0000 |     0.534 | anon[70], wing -- anon[126], conway, cs                           | (cs)<-[:RESEARCHED]-(wing)   |
| | |                 +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+------------------------------+
| | +Expand(Into)     |              0 |    1 |       2 |               7 |                 0 |               1.0000 |     0.646 | anon[126] -- conway, cs                                           | (cs)<-[:RESEARCHED]-(conway) |
| | |                 +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+------------------------------+
| | +CartesianProduct |              1 |    1 |       0 |               7 |                 0 |               1.0000 |     0.654 | cs -- conway                                                      |                              |
| | |\                +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+------------------------------+
| | | +NodeIndexSeek  |              1 |    1 |       2 |               7 |                 0 |               1.0000 |     0.808 | conway                                                            | :Scientist(name)             |
| | |                 +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+------------------------------+
| | +NodeIndexSeek    |              1 |    1 |       2 |               7 |                 0 |               1.0000 |     0.942 | cs                                                                | :Science(name)               |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+------------------------------+
| +Filter             |              0 |    1 |       1 |               3 |                 0 |               1.0000 |     0.622 | anon[43], liskov, wing                                            | wing:Scientist               |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+------------------------------+
| +Expand(All)        |              0 |    1 |       2 |               3 |                 0 |               1.0000 |     0.854 | anon[43], wing -- liskov                                          | (liskov)-[:KNOWS]->(wing)    |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+------------------------------+
| +NodeIndexSeek      |              1 |    1 |       2 |               3 |                 0 |               1.0000 |     1.271 | liskov                                                            | :Scientist(name)             |
+---------------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+-------------------------------------------------------------------+------------------------------+

Total database accesses: 16
```

##### 여러 노드에서 얻은 힌트 

쿼리 플랜은 여러 가지 특정 포인트와 결합하도록 만들어질 수 있습니다. 이것은 여러 방향의 같은 노드로 확장을 요구합니다. 

**쿼리**

```
MATCH (liskov:Scientist { name:'Liskov' })-[:KNOWS]->(wing:Scientist { name:'Wing' })-[:RESEARCHED]->(cs:Science { name:'Computer Science' })<-[:RESEARCHED]-(liskov)
USING INDEX liskov:Scientist(name)
USING JOIN ON liskov, cs
RETURN wing.born AS column
```

'Jeanette Wing'가 태어난 날짜를 반환합니다.

**쿼리 플랜**

```
Compiler CYPHER 3.4

Planner COST

Runtime COMPILED

Runtime version 3.4

+---------------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+-----------------------------------------------------------+----------------------------------------------+
| Operator            | Estimated Rows | Rows | DB Hits | Page Cache Hits | Page Cache Misses | Page Cache Hit Ratio | Time (ms) | Variables                                                 | Other                                        |
+---------------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+-----------------------------------------------------------+----------------------------------------------+
| +ProduceResults     |              0 |    1 |       0 |               7 |                 0 |               1.0000 |     0.175 | anon[142], anon[43], anon[86], column, cs, liskov, wing   |                                              |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-----------------------------------------------------------+----------------------------------------------+
| +Projection         |              0 |    1 |       1 |               7 |                 0 |               1.0000 |     0.210 | column -- anon[142], anon[43], anon[86], cs, liskov, wing | {column : wing.born}                         |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-----------------------------------------------------------+----------------------------------------------+
| +Filter             |              0 |    1 |       0 |               7 |                 0 |               1.0000 |     0.219 | anon[142], anon[43], anon[86], cs, liskov, wing           | not `anon[142]` = `anon[86]`                 |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-----------------------------------------------------------+----------------------------------------------+
| +NodeHashJoin       |              0 |    1 |       0 |              12 |                 0 |               1.0000 |     1.051 | anon[43], anon[86], wing -- anon[142], cs, liskov         | liskov, cs                                   |
| |\                  +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-----------------------------------------------------------+----------------------------------------------+
| | +Expand(Into)     |              0 |    1 |       2 |               7 |                 0 |               1.0000 |     0.441 | anon[142] -- cs, liskov                                   | (cs)<-[:RESEARCHED]-(liskov)                 |
| | |                 +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-----------------------------------------------------------+----------------------------------------------+
| | +CartesianProduct |              1 |    1 |       0 |               7 |                 0 |               1.0000 |     0.455 | cs -- liskov                                              |                                              |
| | |\                +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-----------------------------------------------------------+----------------------------------------------+
| | | +NodeIndexSeek  |              1 |    1 |       2 |               7 |                 0 |               1.0000 |     0.620 | liskov                                                    | :Scientist(name)                             |
| | |                 +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-----------------------------------------------------------+----------------------------------------------+
| | +NodeIndexSeek    |              1 |    1 |       2 |               7 |                 0 |               1.0000 |     0.762 | cs                                                        | :Science(name)                               |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-----------------------------------------------------------+----------------------------------------------+
| +Filter             |              0 |    3 |       4 |              10 |                 0 |               1.0000 |     0.798 | anon[43], anon[86], cs, liskov, wing                      | cs:Science; cs.name = $`  AUTOSTRING2`       |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-----------------------------------------------------------+----------------------------------------------+
| +Expand(All)        |              0 |    2 |       3 |               5 |                 0 |               1.0000 |     0.877 | anon[86], cs -- anon[43], liskov, wing                    | (wing)-[:RESEARCHED]->(cs)                   |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-----------------------------------------------------------+----------------------------------------------+
| +Filter             |              0 |    2 |       2 |               5 |                 0 |               1.0000 |     1.113 | anon[43], liskov, wing                                    | wing.name = $`  AUTOSTRING1`; wing:Scientist |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-----------------------------------------------------------+----------------------------------------------+
| +Expand(All)        |              0 |    1 |       2 |               5 |                 0 |               1.0000 |     1.427 | anon[43], wing -- liskov                                  | (liskov)-[:KNOWS]->(wing)                    |
| |                   +----------------+------+---------+-----------------+-------------------+----------------------+-----------+-----------------------------------------------------------+----------------------------------------------+
| +NodeIndexSeek      |              1 |    1 |       2 |               5 |                 0 |               1.0000 |     1.934 | liskov                                                    | :Scientist(name)                             |
+---------------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+-----------------------------------------------------------+----------------------------------------------+

Total database accesses: 20
```

#### 3.6.4.5. ```PERIODIC COMMIT``` 쿼리 힌트 


CSV 파일에서 데이터를 임포트 하는 방법은[섹션 2.2.6, Cypher로 CSV 파일 임포트](/get-started/cypher.md)을 참조하면 됩니다. 

단일 사이퍼 쿼리와 ```LOAD CSV```을 사용해서 많은 양의 데이터를 임포트하면 메모리 한계로 실패할 수 있습니다. 이것은 ```OutOfMemoryError``` 상태를 나타냅니다.

이 상황에서, Cypher은 단지 ```LOAD CSV```를 사용해서 쿼리를 업데이트할 때 전역 ```USING PERIODIC COMMIT``` 쿼리 힌트를 제공합니다. 필요할 경우, 커밋 별 열의 개수는 다음과 같이 한계 설정 됩니다: ```USING PERIODIC COMMIT 500```.

```PERIODIC COMMIT```은 열이 한계치에 도달할 때 까지 진행합니다. 그 후, 현재 트랜잭션은 커밋되고 새롭게 열린 트랜잭션으로 대체됩니다. 설정할 한계치가 없을 경우에는 기본 값이 사용됩니다.

```PERIODIC COMMIT```을 사용하면 많은 양의 데이터를 임포트할 때 메모리 용량 초과 현상을 막을 것 입니다. 그러나, 이것은 또한 트랜잭션 고립을 깨서 필요한 곳에 쓰일 것 입니다. 